Autodesk.Revit.DB.ViewNode.GetLocalToProjScale
Returns the local instance and view scales.
Since:
2014

Autodesk.Revit.DB.ViewNode.GetProjToPageScale
Returns the zoom scale.
Since:
2014

Autodesk.Revit.DB.ViewNode.GetLocalToPageScale
Returns the local instance, view and zoom scales.
Since:
2014